#ifndef __AIRCRAFTWAR_H
#define __AIRCRAFTWAR_H

/*================================================================
	includes
================================================================*/

#include "stdio.h"		// 调试输出
#include "stdint.h"
#include "oled.h"		// 显示载体

/*================================================================
	显示载体相关宏
================================================================*/

#define AW_SCREEN_WIDTH						(OLED_COL_MAX)		/* 屏幕宽 */
#define AW_SCREEN_HEIGH						(OLED_ROW_MAX)		/* 屏幕高 */

#define AW_SCREEN_PIXEL_SIZE_DEFAULT		(1)					/* 默认像素大小 */

/*================================================================
	显示载体相关结构体
================================================================*/

// 屏幕参数
typedef struct{
	uint16_t width;
	uint16_t height;
	uint8_t pixelSize;
}AW_Screen_Size;

/*================================================================
	声明显示载体相关变量信息
================================================================*/

extern AW_Screen_Size AW_SS;

/*================================================================
	声明显示载体相关函数
================================================================*/

void AW_Screen_Refresh(void);

#endif /* __AIRCRAFTWAR_H */
