#include "AW_Player.h"

/*================================================================
	游戏成员设计相关变量
================================================================*/

static uint8_t AW_Player_Num = 0;  // 游戏成员数目，由于单例设计

/*================================================================
	游戏成员结构体
================================================================*/

typedef struct{
	AW_Bullet_t bullets[AW_PLAYER_BULLETS_NUM_MAX];		// 子弹
	Point p;					// 位置坐标
	uint8_t bloodVol;			// 血量
} AW_Player_t;
